In [3]:
import pandas as pd
exam = pd.read_csv('exam.csv')

In [6]:
# math 평균 구하기 
exam.agg(mean_math = ('math', 'mean'))

            math
mean_math  57.45

In [7]:
# 반(nclass)별로 그룹화하고, 그룹별로 변수(컬럼) math에 대한 평균(mean)을 구하고,
# 변수 이름을 mean_math로 함.
# 기본적으로 nclass가 인덱스가 됨
exam.groupby('nclass').agg(mean_math = ('math', 'mean'))

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00

In [8]:
# 반(nclass)별로 그룹화하고,
# 그룹별로 변수(컬럼) math에 대한 평균(mean)을 구하고,
# 변수 이름을 mean_math로 함.
# nclass를 인덱스로 만들지 않음
exam.groupby('nclass', as_index = False).agg(mean_math = ('math', 'mean'))

   nclass  mean_math
0       1      46.25
1       2      61.25
2       3      45.00
3       4      56.75
4       5      78.00

In [9]:
# 반(nclass)별로 그룹화하고, 그룹별로
# mean_math 변수에 math에 대한 평균(mean) 값을
# sum_math 변수에 math에 대한 합(sum) 값을 생성함
exam.groupby('nclass') \
.agg(mean_math = ('math', 'mean'),
sum_math = ('math', 'sum'))

        mean_math  sum_math
nclass
1           46.25       185
2           61.25       245
3           45.00       180
4           56.75       227
5           78.00       312

In [11]:
# 반(nclass)별로 그룹화하고, 그룹별로
# mean_math 변수에 math에 대한 평균(mean) 값을
# sum_math 변수에 math에 대한 합(sum) 값을 생성함
# median_math 변수에 math에 대한 중앙값(median) 값을 생성함
# n 변수에 math에 대한 그룹내 개수(count) 값을 생성함
exam.groupby('nclass') \
.agg(mean_math = ('math', 'mean'),
     sum_math = ('math', 'sum'),
     median_math = ('math', 'median'),
     n = ('math', 'count')
)

        mean_math  sum_math  median_math  n
nclass
1           46.25       185         47.5  4
2           61.25       245         65.0  4
3           45.00       180         47.5  4
4           56.75       227         53.0  4
5           78.00       312         79.0  4

In [12]:
# 반(nclass)별로 그룹화하고, 그룹별로
# 각 변수에 대한 평균(mean) 값 구하기
exam.groupby('nclass').mean()

          id   math  english  science
nclass
1        2.5  46.25    94.75    61.50
2        6.5  61.25    84.25    58.25
3       10.5  45.00    86.50    39.25
4       14.5  56.75    84.75    55.00
5       18.5  78.00    74.25    83.25

In [3]:
# mpg.csv 데이터를 데이터 프레임 mpg로 읽어 들임
import pandas as pd
mpg = pd.read_csv('mpg.csv')

In [6]:
# 자동차 브랜드별로 drv 방식별로 cty의 평균, 도심에서의 연비의 평균을 구해라 (asscending=Fals - 큰수부터 나타내게 하기 )
mpg.groupby(['manufacturer', 'drv']).agg(mean_cty = ('cty', 'mean')) \
    .sort_values('mean_cty', ascending=False).head()

                   mean_cty
manufacturer drv
honda        f    24.444444
toyota       f    21.368421
volkswagen   f    20.925926
nissan       f    20.000000
subaru       4    19.285714

In [5]:
# 제조사(manufacturer)가 audi인 자동차를 대상으로
# 구동방식(drv)에 따라 그룹화하고, 그룹별로
# n 변수에 구동방식 drv에 대한 그룹네 개수(count) 값을 구하여 출력
mpg.query('manufacturer == "audi"') \
.groupby(['drv']) \
.agg(n = ('drv', 'count'))

      n
drv
4    11
f     7

In [7]:
# 구동방식(drv)에 따라 그룹화하고, 그룹별로
# n 변수에 구동방식 drv에 대한 그룹네 개수(count) 값을 구하여 출력
mpg.groupby('drv').agg(n = ('drv', 'count'))

       n
drv
4    103
f    106
r     25

In [8]:
# 구동방식 drv에 대한 그룹네 개수 값을 구하여 출력
mpg.value_counts('drv') # 시리즈로 출력

drv
f    106
4    103
r     25
dtype: int64

In [9]:
# 구동방식 drv에 대한 그룹네 개수 값을 구하여 출력
mpg.value_counts('drv').to_frame('count') # 데이터 프레임으로 출력 (변수 이름 count)

     count
drv
f      106
4      103
r       25

In [10]:
# 구동방식 drv에 대한 그룹네 개수가 100개 초과인 구동방식(drv)을 구하여 출력
mpg.value_counts('drv').to_frame('count').query('count > 100')

     count
drv
f      106
4      103

In [11]:
# Lab 4 : mpg 데이터에서 suv 제조사의 합산 평균 연비 상위 1 ~ 5위 제조사 출력하기

In [12]:
# (1) mpg.csv 파일을 데이터 프레임 mpg로 읽어 들임
mpg = pd.read_csv('mpg.csv')